"""Завдання
1.Запросіть у користувача ім'я та місячну зарплату в доларах та виведіть їхню річну зарплату в тисячах доларів.
Наприклад: «Мішель», «12345» → «Річна зарплата Мішель складає 148 тис. доларів».
2. Запросіть ціле число і виведіть True, якщо це парне число діапазоні від 100 до 999, інакше - «False».
3. Як вхідні дані візьмемо ціле число; Це буде ціле число від 101 до 999, а його остання цифра не дорівнює нулю(робити перевірку не обовʼязково) Виведіть число, що складається з чисел першого у зворотньому порядку.
Наприклад: 256 → 652.
4. Запитайте два цілих числа та виведіть:
a. Їхню суму
b. Їхня різниця
c. результат множення
d. Результат поділу першого на друге
e. Залишок від поділу першого на друге
f. True, якщо перше число більше або дорівнює другому, інакше False."""

#1
"""name = input('Tell me your name')
salary = int(input('Write your month salary in $'))
salary_year = salary * 12

print(f'Your salary in a year is: {salary_year}$')"""

#2
"""number = int(input('Say your number>>'))

parne_cislo = number % 2 == 0 and 100 <= number <= 999
print(parne_cislo)"""

#3
"""num_1 = int(input('Укажіть ціле число від 101 до 999:'))
num_diapazon = 101 <= num_1 <= 999 and num_1 % 10 != 0

print(num_diapazon)"""

#4
"""cile_1 = int(input())
cile_2 = int(input())

print(cile_1 + cile_2)
print(cile_1 - cile_2)
print(cile_1 * cile_2)
print(cile_1 / cile_2)
print(cile_1 % cile_2)
print(cile_1 >= cile_2)"""