"""1. Як вхідні дані запитайте ціле число. Якщо воно ділиться на 3, виведіть "foo"; якщо воно ділиться на 5, виведіть "bar";
якщо воно ділиться на обидва, виведіть "ham" (а не "foo" або "bar").
2. Як вхідні дані запитайте два числа та виведіть яке з них менше і яке більше
3. Як вхідні дані запитайте три числа і виведіть найменше, середнє та найбільше. Припустимо, всі вони різні
4. Зіграйте у гру Fizz-Buzz: виведіть усі числа від 1 до 100; якщо число ділиться на 3, замість числа виведіть "fizz".
Якщо воно ділиться на 5, замість числа виведіть "Buzz". Якщо воно ділиться на обидва, виведіть "fizz buzz" замість числа.
6. Зіграйте у гру 7-boom: виведіть усі числа від 1 до 100; якщо число ділиться на 7 або містить цифру 7, виведіть "BOOM" замість числа."""

#1
"""num = int(input('Введіть число'))
if num % 3 == 0 and num % 5 == 0:
    print('ham')
elif num % 3 == 0:
    print('foo')
elif num % 5 == 0:
    print('bar')"""


#2
"""num_1 = int(input('Type 1 num:'))
num_2 = int(input('Type 2 num:'))

if num_1 < num_2:
    print(f'Меншим числом є {num_1}, а більшим - {num_2}')
elif num_1 > num_2:
    print(f'Більшим числом є {num_1}, а меншим - {num_2}')"""

#3
"""a = int(input('Type 1 num:'))
b = int(input('Type 2 num:'))
c = int(input('Type 3 num:'))

if a < b < c:
    print(f'Найменше число - {a}')
    print(f'Середнє число - {b}')
    print(f'Найбільше число - {c}')
elif a > b < c:
    print(f'Найменше число - {b}')
    print(f'Середнє число - {a}')
    print(f'Найбільше число - {c}')
elif a > b > c:
    print(f'Найменше число - {c}')
    print(f'Середнє число - {b}')
    print(f'Найбільше число - {a}')
elif a < b > c:
    print(f'Найменше число - {c}')
    print(f'Середнє число - {a}')
    print(f'Найбільше число - {b}')
else:
    print("IDK")"""

#4
"""4. Зіграйте у гру Fizz-Buzz: виведіть усі числа від 1 до 100; якщо число ділиться на 3, замість числа виведіть "fizz".
Якщо воно ділиться на 5, замість числа виведіть "Buzz". Якщо воно ділиться на обидва, виведіть "fizz buzz" замість числа.

for x in range(1, 100):
    if x % 3 == 0 and x % 5 == 0:
        print('fizz buzz')
    elif x % 3 == 0:
        print('fizz')
    elif x % 5 == 0:
        print('Buzz')
    else:
        print(x)"""

#5
"""6. Зіграйте у гру 7-boom: виведіть усі числа від 1 до 100; якщо число ділиться на 7 або містить цифру 7, виведіть "BOOM" замість числа.
for y in range(1, 100):
    if y % 7 == 0 or '7' in str(y):
        print('BOOM')
    else:
        print(y)"""




